# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_SMPCGLU, [128, 13]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_SMPCGLU, [256, 11]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_SMPCGLU, [384, 9]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SMPCGLU, [384, 7]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [[11, 5, 3], 1, DASI, [256]] # 12-P4/16

  - [12, 1, DRFD, [256]] # 13-P5/32
  - [[-1, 7], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [256, 0.5]] # 15-P5/32

  - [12, 1, nn.Upsample, [None, 2, 'nearest']] # 16-P3/8
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 18-P3/8

  - [[15, 12, 18], 1, DASI, [256]] # 19-P4/16

  - [19, 1, DRFD, [256]] # 20-P5/32
  - [[13, 20, 15], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 22-P5/32

  - [19, 1, nn.Upsample, [None, 2, 'nearest']] # 23-P3/8
  - [[16, 23, 18], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]  # 25-P3/8

  - [[25, 19, 22], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)